<a href="https://colab.research.google.com/github/nananana25/MSI140/blob/main/MIS140_Week_1_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Welcome to MIS140 Week 01

# Introduction to pandas
# üéØ Objectives  
By the end of this session, you‚Äôll be able to:  
‚úÖ Understand the purpose and key features of **pandas**  
‚úÖ Read and write data efficiently using **pandas**  
‚úÖ Perform basic **data exploration**


# üèóÔ∏è Setting Up: Mounting Google Drive in Colab  
To work with datasets stored in Google Drive, you need to **mount your drive**.  
You have two ways to do this:

## **Option 1: Using Code**  
Simply run the following snippet in a code cell:

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

After executing, follow the prompt to **authorize access** to your Google Drive.  

## **Option 2: Using the File Panel**  
1. Click the **folder icon** üìÇ on the left sidebar.  
2. Click **"Mount Drive"** and follow the instructions.

# üì• Loading Your Dataset  
Once your Google Drive is mounted, you‚Äôre ready to **import your dataset**!

## 1. Import the necessary library
Run the following code cell

In [3]:
import pandas as pd

## 2. Load your data into a pandas DataFrame:
Now, let‚Äôs load your dataset into **pandas** so we can start exploring!  

### üìå **What to Do:**  
1. **Find your file path**: Follow **Step 5** in the lab instructions (`lab01.pdf`) to locate your dataset in **Google Drive**.  
2. **Copy & paste** the code below into a new Colab code cell.  
3. **Replace `'your-folder/your-file.csv'`** with the **correct file path** from Step 5.  
4. **Make sure the file path is enclosed in single quotes (`'...'`).**  
5. **Run the cell! üöÄ**  

```python
import pandas as pd

# Replace with the correct file path from your Google Drive
file_path = '/content/drive/My Drive/your-folder/your-file.csv'

# Load the dataset into a pandas DataFrame
df = pd.read_csv(file_path)
```

In [4]:
import pandas as pd

# Copy the above code and run it here!
# Replace with the correct file path from your Google Drive
file_path = '/content/marketing_campaign.csv'

# Load the dataset into a pandas DataFrame
df = pd.read_csv(file_path)


‚úÖ **Success!** Your data is now loaded into `df`.  

üîπ **Want to interact with your data?** Simply type `df` in a new code cell and run it.  
This will display the **first few rows** of your dataset.  

üîç **Next step:** Let's take a quick look at it! üëÄ

# üëÄ Take a Quick Look at the Data

Now that you've loaded your dataset into a **pandas DataFrame**, it's time to explore it!  

---

## üìå **Why is this important?**  
Before diving into analysis, you need to **understand the structure** of your dataset:  
‚úÖ What does the data look like?  
‚úÖ How many rows and columns are there?  
‚úÖ Are there any missing values?  
‚úÖ What are the data types of each column?  

---
## üîç **Let's Start Exploring!**

## View the First Few Rows  
The .head() function displays the first 5 rows by default:

```python
# Show the first 5 rows of the DataFrame
df.head()
```

üí° **Questions to ask:**  
- What kind of data is in each column?  
- Are there any unusual values or missing data?  
- Does anything stand out?  

‚úèÔ∏è **Try it yourself!**  
Copy and run the code in a new cell below to see the top of your dataset.

In [5]:
# Copy the above code and run it here!

df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

üìù **Challenge:** Try changing the number inside `.head()`, like:  

```python
df.head(10)  # Show the first 10 rows
```

What happens? üëÄ

In [6]:
# Try it here
# Show the first 10 rows

df.head(10)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
5,7446,1967,Master,Together,62513.0,0,1,09-09-2013,16,520,...,6,0,0,0,0,0,0,3,11,0
6,965,1971,Graduation,Divorced,55635.0,0,1,13-11-2012,34,235,...,6,0,0,0,0,0,0,3,11,0
7,6177,1985,PhD,Married,33454.0,1,0,08-05-2013,32,76,...,8,0,0,0,0,0,0,3,11,0
8,4855,1974,PhD,Together,30351.0,1,0,06-06-2013,19,14,...,9,0,0,0,0,0,0,3,11,1
9,5899,1950,PhD,Together,5648.0,1,1,13-03-2014,68,28,...,20,1,0,0,0,0,0,3,11,0

##  View the Last Few Rows  
The `.tail()` function works just like `.head()`, but it shows the **last** rows instead:  

```python
# Show the last 5 rows of the DataFrame
df.tail()
```

üí° **Questions to ask:**  
- Do the last rows look different from the first?  
- Are there any unexpected values?  
- Are there missing values at the end?  

üìù **Challenge:** Modify `.tail()` to show **more** rows. Try:  

```python
df.tail(8)  # Show the last 8 rows
```

In [7]:
# Try it here


df.tail(8)  # Show the last 8 rows

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
2232,8080,1986,Graduation,Single,26816.0,0,0,17-08-2012,50,5,...,4,0,0,0,0,0,0,3,11,0
2233,9432,1977,Graduation,Together,666666.0,1,0,02-06-2013,23,9,...,6,0,0,0,0,0,0,3,11,0
2234,8372,1974,Graduation,Married,34421.0,1,0,01-07-2013,81,3,...,7,0,0,0,0,0,0,3,11,0
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

## Display the Whole Dataset  
You can also type `df` by itself to **display the entire dataset** in a Colab cell:  

```python
df
```

‚ö†Ô∏è **Be careful!** If your dataset is large, this might be overwhelming.  

üí° **Questions to ask:**  
- How many rows are shown by default?  
- Can you scroll through the output?  
- How does this compare to using `.head()` and `.tail()`?

In [8]:
# Try it here

df

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

1. there are 10 rows ( 5 rows from the top ), ( 5 rows from the bottom )
2. no, cannot scroll through all rows.
The middle rows are hidden and replaced by (....)
its only show the first and last few rows.
3. df.head() = first 5 row, df.tail() = last 5 row, and df = df.head()+df.tail() together in one view (with ..... in between).

## Check the Structure of the Dataset  
Use `.info()` to get an overview of column types and missing values:  

```python
# Display DataFrame structure and data types
df.info()
```

üí° **Questions to ask:**  
- How many rows and columns are there?  
- What are the data types (numbers, text, etc.)?  
- Are there any missing values?  

‚úèÔ∏è **Try it in a new code cell below!**

In [9]:
# Copy the above code and run it here!

# Display DataFrame structure and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Z_CostContact        2240 non-null   int64
 27  Z_Revenue            2240 non-null   int64
 28  Response             2240 non-null   int64
dtypes: float64(1), int64(25), object(3)
memory usage: 507.6+ KB

1. there are 2240 rows and 29 columns
2. dtypes: float64(1), int64(25), object(3)
3. yes, there are missing value. Only the income column has missing value,the non-null count is 2216 when it supposed to be 2240, therefore 2240-2216 = 24 missing values

## Get Basic Statistics
Use `.describe()` to generate summary statistics for numerical columns:  

```python
# Get statistics on numerical columns
df.describe()
```

üí° **Questions to ask:**  
- What is the average (`mean`) value of each column?  
- What is the minimum and maximum value?  
- How spread out is the data (`std` = standard deviation)?  

‚úèÔ∏è **Run this code in a new cell to analyze your dataset!**

In [10]:
# Copy the above code and run it here!


# Get statistics on numerical columns
df.describe()

,ID,Year_Birth,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
count,2240.000000,2240.000000,2216.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,...,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.000000,2240.0,2240.0,2240.000000
mean,5592.159821,1968.805804,52247.251354,0.444196,0.506250,49.109375,303.935714,26.302232,166.950000,37.525446,...,5.316518,0.072768,0.074554,0.072768,0.064286,0.013393,0.009375,3.0,11.0,0.149107
std,3246.662198,11.984069,25173.076661,0.538398,0.544538,28.962453,336.597393,39.773434,225.715373,54.628979,...,2.426645,0.259813,0.262728,0.259813,0.245316,0.114976,0.096391,0.0,0.0,0.356274
min,0.000000,1893.000000,1730.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
25%,2828.250000,1959.000000,35303.000000,0.000000,0.000000,24.000000,23.750000,1.000000,16.000000,3.000000,...,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
50%,5458.500000,1970.000000,51381.500000,0.000000,0.000000,49.000000,173.500000,8.000000,67.000000,12.000000,...,6.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
75%,8427.750000,1977.000000,68522.000000,1.000000,1.000000,74.000000,504.250000,33.000000,232.000000,50.000000,...,7.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,3.0,11.0,0.000000
max,11191.000000,1996.000000,666666.000000,2.000000,2.000000,99.000000,1493.000000,199.000000,1725.000000,259.000000,...,20.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,3.0,11.0,1.000000

1. The means :

In [11]:
df.mean(numeric_only= True)

ID                      5592.159821
Year_Birth              1968.805804
Income                 52247.251354
Kidhome                    0.444196
Teenhome                   0.506250
Recency                   49.109375
MntWines                 303.935714
MntFruits                 26.302232
MntMeatProducts          166.950000
MntFishProducts           37.525446
MntSweetProducts          27.062946
MntGoldProds              44.021875
NumDealsPurchases          2.325000
NumWebPurchases            4.084821
NumCatalogPurchases        2.662054
NumStorePurchases          5.790179
NumWebVisitsMonth          5.316518
AcceptedCmp3               0.072768
AcceptedCmp4               0.074554
AcceptedCmp5               0.072768
AcceptedCmp1               0.064286
AcceptedCmp2               0.013393
Complain                   0.009375
Z_CostContact              3.000000
Z_Revenue                 11.000000
Response                   0.149107
dtype: float64

2. The minimum:

In [12]:
df.min(numeric_only= True)

ID                        0.0
Year_Birth             1893.0
Income                 1730.0
Kidhome                   0.0
Teenhome                  0.0
Recency                   0.0
MntWines                  0.0
MntFruits                 0.0
MntMeatProducts           0.0
MntFishProducts           0.0
MntSweetProducts          0.0
MntGoldProds              0.0
NumDealsPurchases         0.0
NumWebPurchases           0.0
NumCatalogPurchases       0.0
NumStorePurchases         0.0
NumWebVisitsMonth         0.0
AcceptedCmp3              0.0
AcceptedCmp4              0.0
AcceptedCmp5              0.0
AcceptedCmp1              0.0
AcceptedCmp2              0.0
Complain                  0.0
Z_CostContact             3.0
Z_Revenue                11.0
Response                  0.0
dtype: float64

The maximum:

In [13]:
df.max(numeric_only = True)

ID                      11191.0
Year_Birth               1996.0
Income                 666666.0
Kidhome                     2.0
Teenhome                    2.0
Recency                    99.0
MntWines                 1493.0
MntFruits                 199.0
MntMeatProducts          1725.0
MntFishProducts           259.0
MntSweetProducts          263.0
MntGoldProds              362.0
NumDealsPurchases          15.0
NumWebPurchases            27.0
NumCatalogPurchases        28.0
NumStorePurchases          13.0
NumWebVisitsMonth          20.0
AcceptedCmp3                1.0
AcceptedCmp4                1.0
AcceptedCmp5                1.0
AcceptedCmp1                1.0
AcceptedCmp2                1.0
Complain                    1.0
Z_CostContact               3.0
Z_Revenue                  11.0
Response                    1.0
dtype: float64

3. Standard Deviation :

In [14]:
df.std(numeric_only = True)

ID                      3246.662198
Year_Birth                11.984069
Income                 25173.076661
Kidhome                    0.538398
Teenhome                   0.544538
Recency                   28.962453
MntWines                 336.597393
MntFruits                 39.773434
MntMeatProducts          225.715373
MntFishProducts           54.628979
MntSweetProducts          41.280498
MntGoldProds              52.167439
NumDealsPurchases          1.932238
NumWebPurchases            2.778714
NumCatalogPurchases        2.923101
NumStorePurchases          3.250958
NumWebVisitsMonth          2.426645
AcceptedCmp3               0.259813
AcceptedCmp4               0.262728
AcceptedCmp5               0.259813
AcceptedCmp1               0.245316
AcceptedCmp2               0.114976
Complain                   0.096391
Z_CostContact              0.000000
Z_Revenue                  0.000000
Response                   0.356274
dtype: float64

important point: the income columns is highly spread and likely has outliers, because the maximum is larger compared to the mean.

In [15]:
df["Income"].mean()

np.float64(52247.25135379061)

In [16]:
df["Income"].max()

666666.0

In [17]:
df["Income"].std()

25173.07666090141

üöÄ Great job! Now that you‚Äôve explored your dataset, you‚Äôre ready to start analyzing it! üéâ

# Data Selection
A **pandas DataFrame** is a table-like structure with rows and columns, similar to a spreadsheet.

## DataFrame structure
![image.png]()  

Each column in a DataFrame is called a Series, which is a one-dimensional data structure.
![image.png]()




To inspect the DataFrame's structure, use the following:  

```python
# View row index labels
df.index

# View column names
df.columns
```

Sorting options:  

- **Sort by index (row labels):**  

  ```python
  df.sort_index()
  ```

- **Sort by column values (e.g., by Age in ascending order):**  

  ```python
  df.sort_values(by="Year_Birth")
  ```
---

In [18]:
# Try it yourself
# View row index labels
df.sort_index()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

In [19]:
# View column names
df.sort_values(by="Year_Birth")

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
239,11004,1893,2n Cycle,Single,60182.0,0,1,17-05-2014,23,8,...,4,0,0,0,0,0,0,3,11,0
339,1150,1899,PhD,Together,83532.0,0,0,26-09-2013,36,755,...,1,0,0,1,0,0,0,3,11,0
192,7829,1900,2n Cycle,Divorced,36640.0,1,0,26-09-2013,99,15,...,5,0,0,0,0,0,1,3,11,0
1950,6663,1940,PhD,Single,51141.0,0,0,08-07-2013,96,144,...,5,0,0,0,0,0,0,3,11,0
424,6932,1941,PhD,Married,93027.0,0,0,13-04-2013,77,1285,...,2,0,0,1,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2213,3661,1995,2n Cycle,Single,80617.0,0,0,12-10-2012,42,594,...,2,0,0,0,0,0,0,3,11,0
1850,4427,1995,2n Cycle,Single,83257.0,0,0,18-09-2012,56,536,...,6,1,0,1,0,0,1,3,11,1
995,5184,1995,Graduation,Single,34824.0,0,0,26-03-2014,65,4,...,6,0,0,0,0,0,0,3,11,0
1170,193,1996,Basic,Married,14421.0,0,0,17-02-2014,81,0,...,5,1,0,0,0,0,0,3,11,0
46,9909,1996,2n Cycle,Married,7500.0,0,0,09-11-2012,24,3,...,9,0,0,0,0,0,0,3,11,1

## Column Selection
![image.png]()

### Selecting a Single Column  

To select a specific column, use square brackets with the column name:  

```python
age = df["Year_Birth"]
```

This returns a **Series**. To confirm:  

```python
type(age)  # pandas.Series
```

To check the number of rows:  

```python
age.shape  
```

---

In [20]:
# Try it yourself

age = df["Year_Birth"]
type(age)  # pandas.Series
age.shape
display(age)

0       1957
1       1954
2       1965
3       1984
4       1981
        ...
2235    1967
2236    1946
2237    1981
2238    1956
2239    1954
Name: Year_Birth, Length: 2240, dtype: int64

### Selecting Multiple Columns

To select multiple columns, use double square brackets:  

```python
age_education = df[["Year_Birth", "Education"]]
```

This returns a **DataFrame**. To confirm:  

```python
type(age_education)  # pandas.DataFrame
```

Check its dimensions (rows, columns):  

```python
age_education.shape  # (2240, 2)
```

---

In [21]:
# Try it yourself
age_education = df[["Year_Birth", "Education"]]
type(age_education)  # pandas.DataFrame
age_education.shape  # (2240, 2)
display(age_education)

      Year_Birth   Education
0           1957  Graduation
1           1954  Graduation
2           1965  Graduation
3           1984  Graduation
4           1981         PhD
...          ...         ...
2235        1967  Graduation
2236        1946         PhD
2237        1981  Graduation
2238        1956      Master
2239        1954         PhD

[2240 rows x 2 columns]

### Exercises

1. Select only the **customer‚Äôs income** column.

In [22]:
age_income = df["Income"]
type(age_income)  # pandas.Series
age_income.shape
display(age_income)

0       58138.0
1       46344.0
2       71613.0
3       26646.0
4       58293.0
         ...
2235    61223.0
2236    64014.0
2237    56981.0
2238    69245.0
2239    52869.0
Name: Income, Length: 2240, dtype: float64

2. Select the **age, education, and income** columns together.

In [23]:
age_education_income = df[["Year_Birth", "Education", "Income"]]
type(age_education_income)
age_education_income.shape
display(age_education_income)

      Year_Birth   Education   Income
0           1957  Graduation  58138.0
1           1954  Graduation  46344.0
2           1965  Graduation  71613.0
3           1984  Graduation  26646.0
4           1981         PhD  58293.0
...          ...         ...      ...
2235        1967  Graduation  61223.0
2236        1946         PhD  64014.0
2237        1981  Graduation  56981.0
2238        1956      Master  69245.0
2239        1954         PhD  52869.0

[2240 rows x 3 columns]

3. Sort the dataset by **Income** in ascending and descending order.

Ascending (smallest to largest)

In [24]:
df.sort_values(by='Income', ascending= True)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
1245,6862,1971,Graduation,Divorced,1730.0,0,0,18-05-2014,65,1,...,20,0,0,0,0,0,0,3,11,0
21,5376,1979,Graduation,Married,2447.0,1,0,06-01-2013,42,1,...,1,0,0,0,0,0,0,3,11,0
1524,11110,1973,Graduation,Single,3502.0,1,0,13-04-2013,56,2,...,14,0,0,0,0,0,0,3,11,0
1846,9931,1963,PhD,Married,4023.0,1,1,23-06-2014,29,5,...,19,0,0,0,0,0,0,3,11,0
1975,10311,1969,Graduation,Married,4428.0,0,1,05-10-2013,0,16,...,1,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2078,5079,1971,Graduation,Married,NaN,1,1,03-03-2013,82,71,...,8,0,0,0,0,0,0,3,11,0
2079,10339,1954,Master,Together,NaN,0,1,23-06-2013,83,161,...,6,0,0,0,0,0,0,3,11,0
2081,3117,1955,Graduation,Single,NaN,0,1,18-10-2013,95,264,...,7,0,0,0,0,0,0,3,11,0
2084,5250,1943,Master,Widow,NaN,0,0,30-10-2013,75,532,...,1,0,0,1,0,0,0,3,11,1
2228,8720,1978,2n Cycle,Together,NaN,0,0,12-08-2012,53,32,...,0,0,1,0,0,0,0,3,11,0

Descending (largest to smallest)

In [25]:
df.sort_values(by='Income', ascending= False)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
2233,9432,1977,Graduation,Together,666666.0,1,0,02-06-2013,23,9,...,6,0,0,0,0,0,0,3,11,0
617,1503,1976,PhD,Together,162397.0,1,1,03-06-2013,31,85,...,1,0,0,0,0,0,0,3,11,0
687,1501,1982,PhD,Married,160803.0,0,0,04-08-2012,21,55,...,0,0,0,0,0,0,0,3,11,0
1300,5336,1971,Master,Together,157733.0,1,0,04-06-2013,37,39,...,1,0,0,0,0,0,0,3,11,0
164,8475,1973,PhD,Married,157243.0,0,1,01-03-2014,98,20,...,0,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2078,5079,1971,Graduation,Married,NaN,1,1,03-03-2013,82,71,...,8,0,0,0,0,0,0,3,11,0
2079,10339,1954,Master,Together,NaN,0,1,23-06-2013,83,161,...,6,0,0,0,0,0,0,3,11,0
2081,3117,1955,Graduation,Single,NaN,0,1,18-10-2013,95,264,...,7,0,0,0,0,0,0,3,11,0
2084,5250,1943,Master,Widow,NaN,0,0,30-10-2013,75,532,...,1,0,0,1,0,0,0,3,11,1
2228,8720,1978,2n Cycle,Together,NaN,0,0,12-08-2012,53,32,...,0,0,1,0,0,0,0,3,11,0

sort more than one values (ex=year_birth and income)

In [26]:
df.sort_values(by=['Income','Year_Birth'], ascending=[True, False])

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
1245,6862,1971,Graduation,Divorced,1730.0,0,0,18-05-2014,65,1,...,20,0,0,0,0,0,0,3,11,0
21,5376,1979,Graduation,Married,2447.0,1,0,06-01-2013,42,1,...,1,0,0,0,0,0,0,3,11,0
1524,11110,1973,Graduation,Single,3502.0,1,0,13-04-2013,56,2,...,14,0,0,0,0,0,0,3,11,0
1846,9931,1963,PhD,Married,4023.0,1,1,23-06-2014,29,5,...,19,0,0,0,0,0,0,3,11,0
1975,10311,1969,Graduation,Married,4428.0,0,1,05-10-2013,0,16,...,1,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
91,9235,1957,Graduation,Single,NaN,1,1,27-05-2014,45,7,...,7,0,0,0,0,0,0,3,11,0
2081,3117,1955,Graduation,Single,NaN,0,1,18-10-2013,95,264,...,7,0,0,0,0,0,0,3,11,0
2079,10339,1954,Master,Together,NaN,0,1,23-06-2013,83,161,...,6,0,0,0,0,0,0,3,11,0
48,7244,1951,Graduation,Single,NaN,2,1,01-01-2014,96,48,...,6,0,0,0,0,0,0,3,11,0
2084,5250,1943,Master,Widow,NaN,0,0,30-10-2013,75,532,...,1,0,0,1,0,0,0,3,11,1

## Row Filter
![image.png]()
Filtering data allows you to focus on specific **customers**, **transactions**, or **events** that match certain criteria. Pandas makes it easy to filter rows using **conditional expressions** and **boolean logic**.

### Filtering Based on a Single Condition
To filter rows, place a **condition** inside square brackets `[]`.  

#### Example: Customers born before 1980  

```python
older_customers = df[df['Year_Birth'] < 1980]
```

- This selects all rows where **Year_Birth** is **less than 1980**.  
- The result is a **filtered DataFrame** with only those customers.  

You can check the size of the filtered dataset using:  

```python
older_customers.shape  # (Number of matching rows, columns)
```

üí° **Try modifying the condition** to select customers born after 1990.  

---

In [27]:
older_customers = df[df['Year_Birth'] > 1990]
older_customers.shape  # (Number of matching rows, columns)
display(older_customers)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
46,9909,1996,2n Cycle,Married,7500.0,0,0,09-11-2012,24,3,...,9,0,0,0,0,0,0,3,11,1
111,7431,1991,PhD,Single,68126.0,0,0,10-11-2012,40,1332,...,9,0,1,0,0,0,0,3,11,1
113,999,1991,Graduation,Single,86037.0,0,0,02-01-2013,95,490,...,3,0,1,1,0,0,0,3,11,1
140,821,1992,Master,Single,92859.0,0,0,19-10-2012,46,962,...,2,0,0,0,0,0,0,3,11,0
309,1379,1992,Master,Together,42670.0,0,0,27-04-2013,12,154,...,4,0,0,0,0,0,0,3,11,0
392,2669,1993,Graduation,Single,74293.0,0,0,04-05-2014,66,375,...,2,0,0,0,0,0,0,3,11,0
395,3428,1991,PhD,Together,68682.0,0,0,06-10-2013,56,919,...,2,0,0,0,0,0,0,3,11,0
417,5067,1994,Graduation,Together,80134.0,0,0,14-02-2014,11,966,...,5,0,1,1,1,1,0,3,11,0
508,3386,1992,Graduation,Married,34935.0,0,0,21-06-2013,71,34,...,7,0,0,0,0,0,0,3,11,0
522,9214,1991,Graduation,Married,42691.0,0,0,16-08-2013,48,179,...,5,0,0,0,0,0,0,3,11,0
696,8315,1995,Graduation,Single,34824.0,0,0,26-03-2014,65,4,...,6,0,0,0,0,0,0,3,11,0
729,11101,1991,Graduation,Together,89891.0,0,0,15-04-2013,17,412,...,4,0,0,1,0,0,0,3,11,0
747,10548,1995,Graduation,Single,71163.0,0,0,09-03-2014,30,283,...,1,0,0,0,0,0,0,3,11,0
831,8560,1992,Graduation,Single,48789.0,0,0,10-09-2012,94,351,...,6,0,0,0,0,0,0,3,11,0
846,10343,1991,2n Cycle,Single,61618.0,0,0,29-09-2012,27,605,...,3,0,0,0,0,0,0,3,11,0
893,9960,1991,Basic,Single,26868.0,1,0,30-04-2014,52,0,...,7,0,0,0,0,0,0,3,11,0
911,4654,1992,Graduation,Together,75114.0,0,0,07-11-2013,40,571,...,2,0,0,0,0,0,0,3,11,0
914,10619,1994,Graduation,Single,95529.0,0,0,03-12-2012,29,770,...,3,0,0,1,0,0,0,3,11,1
921,4483,1993,Graduation,Single,72354.0,0,0,17-04-2013,67,315,...,1,0,0,0,0,0,0,3,11,0
928,10037,1993,Graduation,Single,74293.0,0,0,04-05-2014,66,375,...,2,0,0,0,0,0,0,3,11,0
995,5184,1995,Graduation,Single,34824.0,0,0,26-03-2014,65,4,...,6,0,0,0,0,0,0,3,11,0
1042,10749,1991,Graduation,Single,8028.0,0,0,18-09-2012,62,73,...,19,0,0,0,0,0,0,3,11,0
1066,3005,1992,Graduation,Single,83528.0,0,0,01-05-2014,7,530,...,1,1,0,0,1,0,0,3,11,1
1163,6905,1994,Graduation,Together,80685.0,0,0,22-08-2012,55,241,...,2,0,0,0,0,0,0,3,11,0
1170,193,1996,Basic,Married,14421.0,0,0,17-02-2014,81,0,...,5,1,0,0,0,0,0,3,11,0
1179,5735,1991,Master,Single,90638.0,0,0,13-02-2014,29,1156,...,1,0,0,1,0,0,0,3,11,0
1218,4500,1991,PhD,Together,68682.0,0,0,06-10-2013,56,919,...,2,0,0,0,0,0,0,3,11,0
1246,4136,1992,Basic,Single,7500.0,1,0,03-12-2012,63,10,...,9,0,0,0,0,0,0,3,11,0
1351,5080,1993,Graduation,Single,70515.0,0,0,21-10-2013,12,420,...,2,0,0,0,0,0,0,3,11,1
1361,1384,1992,Basic,Married,17256.0,1,0,23-11-2013,10,6,...,8,1,0,0,0,0,0,3,11,0
1572,5350,1991,Master,Single,90638.0,0,0,13-02-2014,29,1156,...,1,0,0,1,0,0,0,3,11,1
1578,8175,1992,Graduation,Married,34935.0,0,0,21-06-2013,71,34,...,7,0,0,0,0,0,0,3,11,0
1675,4712,1991,2n Cycle,Together,20193.0,0,0,28-11-2012,18,8,...,4,0,0,0,0,0,0,3,11,0
1714,4055,1992,Basic,Single,18746.0,1,0,29-05-2014,41,2,...,6,0,0,0,0,0,0,3,11,0
1722,569,1991,Graduation,Single,90273.0,0,0,14-12-2013,32,704,...,2,0,1,1,1,0,0,3,11,1
1813,10513,1992,Graduation,Together,63207.0,0,0,20-01-2013,68,438,...,7,0,0,0,1,0,0,3,11,0
1850,4427,1995,2n Cycle,Single,83257.0,0,0,18-09-2012,56,536,...,6,1,0,1,0,0,1,3,11,1
1987,4552,1991,Graduation,Married,51373.0,0,0,22-06-2013,37,83,...,4,0,0,0,0,0,0,3,11,0
2040,5631,1991,Graduation,Single,49767.0,0,0,02-05-2013,92,202,...,4,0,0,0,0,0,0,3,11,0
2086,2802,1992,2n Cycle,Married,87000.0,0,0,15-12-2012,61,196,...,2,0,0,0,0,0,0,3,11,0
2093,7734,1993,Graduation,Absurd,79244.0,0,0,19-12-2012,58,471,...,1,0,0,1,1,0,0,3,11,1
2164,7600,1992,Basic,Single,15253.0,1,0,28-10-2013,13,1,...,7,0,0,0,0,0,0,3,11,0
2213,3661,1995,2n Cycle,Single,80617.0,0,0,12-10-2012,42,594,...,2,0,0,0,0,0,0,3,11,0

### Filtering Based on Multiple Conditions
Use **`&` (AND)** to filter rows that match **all** conditions.  
Use **`|` (OR)** to filter rows that match **at least one** condition.  

#### Example: Customers born before 1980 AND earning more than $70,000  

```python
older_high_income = df[(df["Year_Birth"] < 1980) & (df["Income"] > 70000)]
```

#### Example: Customers with Kids OR Teens at home  

```python
parents = df[(df["Kidhome"] > 0) | (df["Teenhome"] > 0)]
```

- This selects customers who have at least **one kid** OR **one teenager** at home.  

---

In [28]:
parents = df[(df["Kidhome"] >= 1) | (df["Teenhome"] >= 1)]
display(parents)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
5,7446,1967,Master,Together,62513.0,0,1,09-09-2013,16,520,...,6,0,0,0,0,0,0,3,11,0
6,965,1971,Graduation,Divorced,55635.0,0,1,13-11-2012,34,235,...,6,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2234,8372,1974,Graduation,Married,34421.0,1,0,01-07-2013,81,3,...,7,0,0,0,0,0,0,3,11,0
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

### Filtering for Specific Categories

To filter based on **categorical values**, use `.isin()`.  

#### Example: Customers with "Graduation" or "PhD" education levels  

```python
educated_customers = df[df["Education"].isin(["Graduation", "PhD"])]
```

In [29]:
educated_customers = df[df["Education"].isin(["Graduation", "PhD"])]
display(educated_customers)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2234,8372,1974,Graduation,Married,34421.0,1,0,01-07-2013,81,3,...,7,0,0,0,0,0,0,3,11,0
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

### Exercises

1. Customers born after 1995 AND earning less than $40,000

In [30]:
df[(df["Year_Birth"] > 1995) & (df['Income'] < 40000)]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
46,9909,1996,2n Cycle,Married,7500.0,0,0,09-11-2012,24,3,...,9,0,0,0,0,0,0,3,11,1
1170,193,1996,Basic,Married,14421.0,0,0,17-02-2014,81,0,...,5,1,0,0,0,0,0,3,11,0

2. Customers who are Married OR have an income greater than $90,000

In [31]:
df[(df['Marital_Status'] == 'Married') | (df['Income'] > 90000)]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0
7,6177,1985,PhD,Married,33454.0,1,0,08-05-2013,32,76,...,8,0,0,0,0,0,0,3,11,0
10,1994,1983,Graduation,Married,NaN,1,0,15-11-2013,11,5,...,7,0,0,0,0,0,0,3,11,0
11,387,1976,Basic,Married,7500.0,0,0,13-11-2012,59,6,...,8,0,0,0,0,0,0,3,11,0
14,2569,1987,Graduation,Married,17323.0,0,0,10-10-2012,38,3,...,8,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2229,10084,1972,Graduation,Married,24434.0,2,0,18-05-2014,9,3,...,7,0,0,0,0,0,0,3,11,0
2233,9432,1977,Graduation,Together,666666.0,1,0,02-06-2013,23,9,...,6,0,0,0,0,0,0,3,11,0
2234,8372,1974,Graduation,Married,34421.0,1,0,01-07-2013,81,3,...,7,0,0,0,0,0,0,3,11,0
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1


3. Customers who are "Single" or "Divorced"

In [32]:
df[(df['Marital_Status'] == 'Single') | (df['Marital_Status'] == 'Divorced')]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
6,965,1971,Graduation,Divorced,55635.0,0,1,13-11-2012,34,235,...,6,0,0,0,0,0,0,3,11,0
12,2125,1959,Graduation,Divorced,63033.0,0,0,15-11-2013,82,194,...,2,0,0,0,0,0,0,3,11,0
13,8180,1952,Master,Divorced,59354.0,1,1,15-11-2013,53,233,...,6,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2227,4201,1962,Graduation,Single,57967.0,0,1,03-03-2013,39,229,...,5,0,0,0,0,0,0,3,11,0
2230,7004,1984,Graduation,Single,11012.0,1,0,16-03-2013,82,24,...,9,1,0,0,0,0,0,3,11,0
2231,9817,1970,Master,Single,44802.0,0,0,21-08-2012,71,853,...,8,0,0,0,0,0,0,3,11,0
2232,8080,1986,Graduation,Single,26816.0,0,0,17-08-2012,50,5,...,4,0,0,0,0,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0

4. Customers with "Master" or "PhD" education AND earning more than $60,000

In [33]:
df[((df['Education'] == 'Master') | (df['Education'] == 'PhD')) & (df['Income'] > 60000)]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
5,7446,1967,Master,Together,62513.0,0,1,09-09-2013,16,520,...,6,0,0,0,0,0,0,3,11,0
15,2114,1946,PhD,Single,82800.0,0,0,24-11-2012,23,1006,...,3,0,0,1,1,0,0,3,11,1
18,6565,1949,Master,Married,76995.0,0,1,28-03-2013,91,1012,...,5,0,0,0,1,0,0,3,11,0
23,4047,1954,PhD,Married,65324.0,0,1,11-01-2014,0,384,...,4,0,0,0,0,0,0,3,11,0
29,1966,1965,PhD,Married,84618.0,0,0,22-11-2013,96,684,...,2,0,0,1,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2190,4418,1983,Master,Single,89616.0,0,0,25-02-2013,36,671,...,2,0,0,0,0,0,0,3,11,1
2217,9589,1948,PhD,Widow,82032.0,0,0,05-04-2014,54,332,...,1,0,0,0,0,0,0,3,11,0
2221,7366,1982,Master,Single,75777.0,0,0,04-07-2013,12,712,...,1,0,1,1,0,0,0,3,11,1
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0

5. Customers who are Single AND have either Kids OR Teens at home

In [34]:
df[(df['Marital_Status'] == 'Single') & ((df["Kidhome"] > 0) | (df["Teenhome"] > 0))]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
19,2278,1985,2n Cycle,Single,33812.0,1,0,03-11-2012,86,4,...,6,0,0,0,0,0,0,3,11,0
27,5255,1986,Graduation,Single,NaN,1,0,20-02-2013,19,5,...,1,0,0,0,0,0,0,3,11,0
35,10738,1951,Master,Single,49389.0,1,1,29-08-2013,55,40,...,7,0,0,0,0,0,0,3,11,0
48,7244,1951,Graduation,Single,NaN,2,1,01-01-2014,96,48,...,6,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2201,10968,1969,Graduation,Single,57731.0,0,1,23-11-2012,0,266,...,6,0,0,0,0,0,0,3,11,0
2205,5959,1968,Graduation,Single,35893.0,1,1,15-10-2012,80,158,...,8,0,0,0,0,0,0,3,11,0
2224,4286,1970,PhD,Single,57642.0,0,1,09-01-2014,24,580,...,4,1,0,0,0,0,0,3,11,0
2227,4201,1962,Graduation,Single,57967.0,0,1,03-03-2013,39,229,...,5,0,0,0,0,0,0,3,11,0
2230,7004,1984,Graduation,Single,11012.0,1,0,16-03-2013,82,24,...,9,1,0,0,0,0,0,3,11,0

## Specific Rows and Columns Selection
![image.png]()

When analyzing data, you may need to extract specific **rows** and **columns** based on conditions or positions. Pandas provides two powerful methods for this:  

- **`.loc[]`** ‚Äì Selects rows and columns using **labels** (column names or row index values).  
- **`.iloc[]`** ‚Äì Selects rows and columns using **positions** (row and column index numbers).

### Selecting Rows and Columns Using `.loc[]` (Label-Based Selection)

Use `.loc[]` when selecting specific **rows and columns by name**.

#### Example: Select "Education" for customers born before 1980  

```python
education_old_customers = df.loc[df["Year_Birth"] < 1980, "Education"]
```

- The **first part** (`df["Year_Birth"] < 1980`) filters rows where `Year_Birth` is **less than 1980**.  
- The **second part** (`"Education"`) selects only the **Education** column.  

#### Example: Select "Education" and "Income" for customers born before 1980  

```python
old_customers_info = df.loc[df["Year_Birth"] < 1980, ["Education", "Income"]]
```

üí° **Try modifying this to select "Marital_Status" instead.**

In [35]:
df.loc[df["Year_Birth"] < 1980, "Marital_Status"]

0         Single
1         Single
2       Together
5       Together
6       Divorced
          ...
2234     Married
2235     Married
2236    Together
2238    Together
2239     Married
Name: Marital_Status, Length: 1816, dtype: object

### Selecting Rows and Columns Using `.iloc[]` (Position-Based Selection)

Use `.iloc[]` when selecting **rows and columns by their numerical index position**.

#### **Example: Select rows 10 to 25 and columns 3 to 5**  

```python
subset_data = df.iloc[9:25, 2:5]
```

- **Rows 10 to 25** (Python indexing starts at **0**, so row 10 is at index **9**).  
- **Columns 3 to 5** (index **2 to 4**, since the last number is **exclusive**).  

üí° **Modify this to select the first 15 rows and columns 1 to 3.**

In [36]:
subset_data = df.iloc[0:15, 1:3]
display(subset_data)

    Year_Birth   Education
0         1957  Graduation
1         1954  Graduation
2         1965  Graduation
3         1984  Graduation
4         1981         PhD
5         1967      Master
6         1971  Graduation
7         1985         PhD
8         1974         PhD
9         1950         PhD
10        1983  Graduation
11        1976       Basic
12        1959  Graduation
13        1952      Master
14        1987  Graduation

### Updating Values in a DataFrame
You can also update specific values in a DataFrame using `.iloc[]`.

#### Example: Set "Education" to "Unknown" for the first 3 customers  

```python
df.iloc[0:3, df.columns.get_loc("Education")] = "Unknown"
```

üí° **Try changing "Marital_Status" to "Not Disclosed" for the first 5 rows.**  

---

In [37]:
df.iloc[0:5, df.columns.get_loc("Marital_Status")] = "Not Disclosed"
display(df["Marital_Status"])

0       Not Disclosed
1       Not Disclosed
2       Not Disclosed
3       Not Disclosed
4       Not Disclosed
            ...
2235          Married
2236         Together
2237         Divorced
2238         Together
2239          Married
Name: Marital_Status, Length: 2240, dtype: object

### Exercises

1. Select the "Income" column for customers who have **at least one child** (`Kidhome > 0`).

In [38]:
customers = df.loc[df["Kidhome"] > 0, "Income"]
display(customers)

1        46344.0
3        26646.0
4        58293.0
7        33454.0
8        30351.0
          ...
2230     11012.0
2233    666666.0
2234     34421.0
2236     64014.0
2239     52869.0
Name: Income, Length: 947, dtype: float64

2. Select **rows 5 to 20** and **columns 2 to 4** using `.iloc[]`.

In [39]:
subset_data = df.iloc[5:20, 2:4]
display(subset_data)

     Education Marital_Status
5       Master       Together
6   Graduation       Divorced
7          PhD        Married
8          PhD       Together
9          PhD       Together
10  Graduation        Married
11       Basic        Married
12  Graduation       Divorced
13      Master       Divorced
14  Graduation        Married
15         PhD         Single
16  Graduation        Married
17  Graduation       Together
18      Master        Married
19    2n Cycle         Single

3. Select the "Marital_Status" and "Income" of customers who earn **more than $80,000**.

In [40]:
df.loc[df["Income"] > 80000, ["Marital_Status", "Income"]]

     Marital_Status    Income
15           Single   82800.0
29          Married   84618.0
40          Married   80011.0
53         Divorced   82582.0
55         Together   82384.0
...             ...       ...
2193        Married   82347.0
2211       Together   88325.0
2213         Single   80617.0
2217          Widow   82032.0
2233       Together  666666.0

[217 rows x 2 columns]

4. Change the **first 10 values** in the "Recency" column to `0`.

In [41]:
df.iloc[0:10, df.columns.get_loc("Recency")] = 0
display(df)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Not Disclosed,58138.0,0,0,04-09-2012,0,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Not Disclosed,46344.0,1,1,08-03-2014,0,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Not Disclosed,71613.0,0,0,21-08-2013,0,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Not Disclosed,26646.0,1,0,10-02-2014,0,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Not Disclosed,58293.0,1,0,19-01-2014,0,173,...,5,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

# **References & Data Source**  

## **References**  
üìñ **Pandas Documentation:**  
üîó [Getting Started with Pandas](https://pandas.pydata.org/docs/getting_started/intro_tutorials/index.html)  

## **Data Source**  
üìä **Customer Personality Analysis Dataset:**  
üîó [Kaggle Dataset](https://www.kaggle.com/datasets/imakash3011/customer-personality-analysis/data)